// Підключаємо технологію express для back-end сервера
const express = require('express')
// Cтворюємо роутер - місце, куди ми підключаємо ендпоїнти
const router = express.Router()

// ================================================================

// router.get Створює нам один ентпоїнт

// ↙️ тут вводимо шлях (PATH) до сторінки
router.get('/html', function (req, res) {
  res.render('htmlsite', {
    // вказуємо назву контейнера
    name: 'htmlsite',
    // вказуємо назву компонентів
    component: [],

    // вказуємо назву сторінки
    title: 'Development',
    // ... сюди можна далі продовжувати додавати потрібні технічні дані, які будуть використовуватися в layout

    // вказуємо дані,
    mobileScreen: [
      {
        header: {
          time: '9:41',
          signal: '/svg/signal.svg',
          wifi: '/svg/wifi.svg',
          power: '/svg/power.svg',
        },
        main: {
          arrow: '/svg/arrow.svg',
          logo: '/svg/logo.svg',
          title: 'Мій блог',
        },
        blog: [
          {
            important: 'Важлива',
            new: 'Нова',
            date: '25.01',
            text: 'До біса планувальник, наймаємо дизайнера і готуємося до презентації, як Джобс',
          },
          {
            new: 'Нова',
            date: '15.01',
            text: 'Ми хотіли щоб у цьому чаті було близько 150 людей щоб зробити якісний пак самопрезентацій.',
          },
          {
            important: 'Важлива',
            date: '25.01',
            text: 'До біса планувальник, наймаємо дизайнера і готуємося до презентації, як Джобс',
          },
        ],
      },
      {
        header: {
          time: '9:41',
          signal: '/svg/signal.svg',
          wifi: '/svg/wifi.svg',
          power: '/svg/power.svg',
        },
        main: {
          arrow: '/svg/arrow.svg',
          logo: '/svg/logo.svg',
          title: "Ком'юніті",
        },
        comunity: [
          {
            tabs: [
              {
                title: 'База знань',
                active: false,
              },
              {
                title: 'Інформація',
                active: true,
              },
            ],
            badge: '/svg/image.svg',
            text: 'Що таке база знань?',
            description: 'База знаний — база данных, содержащая правила вывода и информацию о человеческом опыте и знаниях в некоторой предметной области. В самообучающихся системах база знаний также содержит информацию, являющуюся результатом решения предыдущих задач.',
            button: "Перейти до ком'юніті у Телеграм"
          },
        ],
      },
    ],
  // ↑↑ сюди вводимо JSON дані
  })
})
router.get('/js', function (req, res) { 
  res.render('jssite', {
    // вказуємо назву контейнера
    name: 'jssite',
    // вказуємо назву компонентів
    component: [],

    // вказуємо назву сторінки
    title: 'Development',
    // ... сюди можна далі продовжувати додавати потрібні технічні дані, які будуть використовуватися в layout
  // ↑↑ сюди вводимо JSON дані
  })
})

// Підключаємо роутер до бек-енду
module.exports = router