//Завдання 7
// Створюємо генератор countdownGenerator, який створює послідовність чисел від вказаного значення до 0, має параметр start
function* countdownGenerator(start) {
  // Ініціюємо лічильник змінну count зі стартовим значенням параметра start
  let count = start;

  // Цикл, що триває доки лічильник більший або рівний 0
  while (count >= 0) {
    // Використовуємо ключове слово yield, щоб повернути поточне значення лічильника
    yield count;

    // Зменшуємо лічильник
    count--;
  }
}

// Створюємо екземпляр генератора countdown
let countdown = countdownGenerator(5);
console.log("Завдання: 7 ==============================");

let nextValue = countdown.next(); // Запускаємо генератор та отримуємо перше значення яку записуємо в змінну nextValue
// Цикл while, що виводить значення з генератора, та працює поки не є генератор вичерпаним.
// Якщо властивість done == false, генератор ще має значення для повернення.

while (!nextValue.done) {
  console.log(nextValue.value); // Виводимо поточне значення
  nextValue = countdown.next(); // Отримуємо наступне значення з генератора
}
